import re
def solve(x):
    dic = {1:"e1-8",2:"e1-11",3:"e2-11",4:"e2-10",5:"e2-9",6:"e2-8",7:"e2-7",8:"e2-4",9:"e3-10",10:"e3-8",11:"e3-7",12:"e4-11",13:"e4-9",14:"e4-7",15:"e5-12",16:"e5-11",17:"e5-10",18:"e5-7",19:"e6-12",20:"e6-12",21:"e6-10",22:"e6-9",23:"e9-11"}
    string = ''
    a = x.split(",") #разделить по любой не-буква, не-цифра и не подчёркивание и добавить в лист, (+) значит может более синоним
    for i in range(int(len(a))):
        string += dic.get(a[i])+ ","
    return string
print(solve("1,2,3"))

